PAKHYUNMOON/CC1101_CC2500/app/master/m_main.c
    start_pkt.fcf  = Proto_FCF_Make(MICS_FCF_TYPE_COMMAND, true, false);
    start_pkt.seq  = g_seq++;
    start_pkt.sess = g_session_id;
    start_pkt.payload_len = Proto_BuildCommandPayload(CMD_STREAM_START,
                                                      g_target_id,
                                                      g_master_id,
                                                      start_args, (uint8_t)sizeof(start_args),
                                                      start_pkt.payload,
                                                      sizeof(start_pkt.payload));
    if (start_pkt.payload_len == 0U) {
        return -1;
    }
    uint8_t tx_len = Proto_BuildPacket(&start_pkt, tx_buf, sizeof(tx_buf));
    if (tx_len == 0U) {
        return -1;
    }
    if (Master_TxLBT_SameChannel(tx_buf, tx_len) != CC1101_OK) {
        return -2;
    }

    /* Wait command ACK for stream start */
    if (CC1101_WaitAndReadPacket(&g_cc1101, g_active_channel,
                                 rx_buf, &rx_len, sizeof(rx_buf),
                                 PROTO_MICS_RESP_TIMEOUT_MS) != CC1101_OK) {
        return -3;
    }

    Proto_Packet ack;
    if (Proto_ParsePacket(rx_buf, rx_len, &ack) < 0) {
        return -4;
    }
    if (!Proto_MatchSession(ack.sess, g_session_id)) {
        return -5;
    }
    if (g_last_rx_seq_valid && !Proto_IsSeqNewer(ack.seq, g_last_rx_seq)) {
        return -6;
    }
    g_last_rx_seq = ack.seq;
    g_last_rx_seq_valid = true;

    if (Proto_FCF_Type(ack.fcf) != MICS_FCF_TYPE_COMMAND) {
        return -7;
    }
    if (!Proto_VerifyPayloadDeviceID(&ack, PROTO_CMD_DEVID_OFFSET, g_target_id) ||
        !Proto_VerifyPayloadMasterID(&ack, PROTO_CMD_MASTERID_OFFSET, g_master_id)) {
        return -8;
    }
    if (ack.payload_len < (PROTO_CMD_ARGS_OFFSET + 1U) ||
        ack.payload[PROTO_CMD_SUBCMD_OFFSET] != CMD_STREAM_ACK ||
        ack.payload[PROTO_CMD_ARGS_OFFSET] != PROTO_STATUS_OK) {
        return -9;
    }

    /* Receive pushed stream DATA copies and recover logical frames */
    uint8_t received = 0U;
    bool stream_seq_valid = false;
    uint8_t last_stream_seq = 0U;
    Master_StreamReassembly reasm = {0};
    while (received < frame_count) {
        if (CC1101_WaitAndReadPacket(&g_cc1101, g_active_channel,
                                     rx_buf, &rx_len, sizeof(rx_buf),
                                     PROTO_MICS_RESP_TIMEOUT_MS) != CC1101_OK) {
            return -10;
        }
        Proto_Packet data_pkt;
        if (Proto_ParsePacket(rx_buf, rx_len, &data_pkt) < 0) {
            continue;
        }
        if (!Proto_MatchSession(data_pkt.sess, g_session_id)) {
            continue;
        }
        if (g_last_rx_seq_valid && !Proto_IsSeqNewer(data_pkt.seq, g_last_rx_seq)) {
            continue;
        }
        g_last_rx_seq = data_pkt.seq;
        g_last_rx_seq_valid = true;

        if (Proto_FCF_Type(data_pkt.fcf) != MICS_FCF_TYPE_DATA) {
            continue;
        }
        if (!Proto_VerifyPayloadDeviceID(&data_pkt, PROTO_DATA_DEVID_OFFSET, g_target_id) ||
            !Proto_VerifyPayloadMasterID(&data_pkt, PROTO_DATA_MASTERID_OFFSET, g_master_id)) {
            continue;
        }
        if (!Master_VerifyStreamDataAuth(&data_pkt, PROTO_DATA_BODY_OFFSET)) {
            continue;
        }
        /* DATA body(copy-FEC mode):
         * NONCE(4) + TAG(4) + stream_seq(1) + copy_idx(1) + copy_total(1) + logical_len(1) + logical_data */
        if (data_pkt.payload_len < (uint8_t)(PROTO_DATA_BODY_OFFSET + AUTH_ARG_LEN + 4U)) {
            continue;
        }
        uint8_t stream_seq = data_pkt.payload[PROTO_DATA_BODY_OFFSET + AUTH_ARG_LEN];
        uint8_t copy_idx = data_pkt.payload[PROTO_DATA_BODY_OFFSET + AUTH_ARG_LEN + 1U];
        uint8_t copy_total = data_pkt.payload[PROTO_DATA_BODY_OFFSET + AUTH_ARG_LEN + 2U];
        uint8_t logical_len = data_pkt.payload[PROTO_DATA_BODY_OFFSET + AUTH_ARG_LEN + 3U];
        uint8_t logical_data_off = (uint8_t)(PROTO_DATA_BODY_OFFSET + AUTH_ARG_LEN + 4U);
        if (data_pkt.payload_len < (uint8_t)(logical_data_off + logical_len)) {
            continue;
        }
        if (!Master_StreamReasmIngest(&reasm, stream_seq, copy_idx, copy_total,
                                      &data_pkt.payload[logical_data_off], logical_len)) {
            continue;
        }

        if (stream_seq_valid) {
            uint8_t expected = (uint8_t)(last_stream_seq + 1U);
            if (stream_seq != expected) {
#if STREAM_USE_OPTIONAL_NACK
                uint8_t gap = (uint8_t)(stream_seq - expected);
                if (gap >= STREAM_NACK_MIN_GAP) {
                    (void)Master_SendStreamNack(expected);
                }
#endif
            }
        }

        if (Master_StreamReasmComplete(&reasm)) {
            last_stream_seq = stream_seq;
            stream_seq_valid = true;
            received++;
            memset(&reasm, 0, sizeof(reasm));
        }
    }

    return 0;
}

/* ========================================================================== */
/* Same-channel LBT helper (Patch B)                                            */
/*                                                                              */
/* Retries CCA on g_active_channel up to MASTER_SAME_CH_RETRIES times with a    */
/* small back-off between attempts. Unlike CC1101_SendPacketLBT_Agile this      */
/* NEVER hops to a different channel, so the Slave stays in sync with the       */
/* channel it was told to camp on in the wake-up beacon.                        */
/* Returns CC1101_OK on successful TX, CC1101_ERR_CCA if every attempt failed.  */
/* ========================================================================== */
static CC1101_Status Master_TxLBT_SameChannel(const uint8_t *tx_buf,
                                              uint8_t tx_len)
{
    CC1101_Status st = CC1101_ERR_CCA;
    for (uint8_t attempt = 0U; attempt < MASTER_SAME_CH_RETRIES; attempt++) {
        st = CC1101_SendPacketLBT(&g_cc1101,
                                  g_active_channel,
                                  tx_buf, tx_len,
                                  CC1101_MICS_LBT_THRESHOLD_DBM,
                                  CC1101_MICS_LBT_LISTEN_MS,
                                  200U);
        if (st == CC1101_OK) {
            return CC1101_OK;
        }
        if (st != CC1101_ERR_CCA) {
            /* Non-CCA failure (SPI / HW) - retry won't help */
            return st;
        }
        /* Pseudo-random back-off: mix seq counter with attempt index to
         * de-correlate colliding Masters. Bounded: [MASTER_SAME_CH_BACKOFF_MS
         * .. MASTER_SAME_CH_BACKOFF_MS + 7]. */
        uint32_t jitter = ((uint32_t)g_seq + attempt) & 0x07U;
        HAL_Delay(MASTER_SAME_CH_BACKOFF_MS + jitter);
    }
    return st;   /* CC1101_ERR_CCA */
}

/* ========================================================================== */
/* Phase 1: Wake-up via CC2500 (2.4 GHz)                                      */
/* ========================================================================== */

