PAKHYUNMOON/CC1101_CC2500/app/master/m_main.c
    return 0;
}

/* ========================================================================== */
/* Full communication session                                                  */
/* ========================================================================== */

static int Master_CommunicationSession(void)
{
    int rc = -1;
    uint8_t data_buf[PROTO_MAX_PAYLOAD];
    uint8_t data_len = 0U;

    /* Outer session-restart loop (Patch B).
     *
     * If same-channel LBT keeps failing on the MICS channel we announced
     * during wake-up (another user has occupied it after our CCA), the
     * Slave is camped on a dead channel. Re-run wake-up from scratch:
     * LBT will pick a NEW free channel, the beacon will advertise it,
     * and the Slave will retune. Bounded by MASTER_SESSION_RESTARTS.
     */
    for (uint8_t attempt = 0U; attempt <= MASTER_SESSION_RESTARTS; attempt++) {
        /* Start each retry from a clean session state. */
        g_session_id = PROTO_SESS_UNASSIGNED;

        /* Phase 1: Wake up implant via 2.4 GHz (with fresh LBT each pass) */
        rc = Master_WakeUpImplant();
        if (rc != 0) {
            continue; /* try again from wake-up - Slave may have missed beacon */
        }

        /* Phase 2: Poll data via 400 MHz MICS */
        rc = Master_PollImplantData(data_buf, &data_len);
        if (rc == -2) {
            /* CCA failure on announced channel: the channel was occupied
             * after our LBT. Restart the session so we re-run LBT and
             * pick a different channel. Slave will session-timeout or be
             * re-woken with the new channel. */
            g_session_id = PROTO_SESS_UNASSIGNED;
            continue;
        }
        if (rc != 0) {
            /* Non-CCA failure (parse, auth, timeout) - end session cleanly */
            Master_SendSleepCommand();
            break;
        }

        /* Process received data (application-specific) */
        /* ... */

        /* Runtime stream control path:
         * 1) push stream config via DATA_WRITE
         * 2) trigger stream start with configured values */
        (void)Master_ConfigureStreamViaDataWrite(g_stream_interval_ms, g_stream_frame_count);
        (void)Master_StreamFromImplant(g_stream_interval_ms, g_stream_frame_count);

        /* Phase 3: End session - send implant back to sleep */
        Master_SendSleepCommand();
        rc = 0;
        break;
    }

    /* Put radios to sleep regardless of outcome */
    CC1101_EnterSleep(&g_cc1101);
    CC2500_EnterSleep(&g_cc2500);

    return rc;
}

/* ========================================================================== */
/* main                                                                        */
/* ========================================================================== */

int main(void)
{
    HAL_Init();

    /* SystemClock_Config() - generated by CubeMX */
    /* MX_GPIO_Init(), MX_SPI1_Init(), MX_SPI2_Init(), MX_RTC_Init() */

    Master_InitHardware();

    while (1) {
        /*
         * Master (Programmer) is typically triggered by user action
         * (e.g., button press or host command).
         * Here we show a simple polling loop; in practice this would be
         * event-driven.
         */

        int result = Master_CommunicationSession();

        if (result == 0) {
            /* Session successful */
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);  /* LED on */
        } else {
            /* Session failed */
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
        }

        /* Wait before next session (or wait for user trigger) */
        HAL_Delay(5000U);
    }
}
